Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
  + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.pgxflow[0].module.lambda-sendJobEmail.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "pgxflow-backend-sendJobEmail-0"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "lambda:InvokeFunction"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:lambda:ap-southeast-3:438465168484:function:cognito-sendClinicJobEmail"
                    },
                  + {
                      + Action   = [
                          + "dynamodb:UpdateItem",
                          + "dynamodb:PutItem",
                          + "dynamodb:GetItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-clinic-jobs"
                    },
                  + {
                      + Action   = "cognito-idp:ListUsers"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:cognito-idp:ap-southeast-3:438465168484:userpool/ap-southeast-3_vthn2gpgm"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "pgxflow-backend-sendJobEmail"
    }

  # module.pgxflow[0].module.lambda-sendJobEmail.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "pgxflow-backend-sendJobEmail-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "pgxflow-backend-sendJobEmail"
    }

  # module.pgxflow[0].module.lambda-sendJobEmail.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Invokes sendJobEmail to send email to user"
      + filename                       = "builds/dbe5a7fe1c70271457859c78a97d99f5fb3bb59ac1969fde460690ec91500c2a.zip"
      + function_name                  = "pgxflow-backend-sendJobEmail"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 1792
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "uat"
          + "NAME"                  = "pgxflow-backend"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "uat"
          + "NAME"                  = "pgxflow-backend"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 28
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "COGNITO_CLINIC_JOB_EMAIL_LAMBDA" = "arn:aws:lambda:ap-southeast-3:438465168484:function:cognito-sendClinicJobEmail"
              + "DYNAMO_CLINIC_JOBS_TABLE"        = "sbeacon-dataportal-clinic-jobs"
              + "USER_POOL_ID"                    = "ap-southeast-3_vthn2gpgm"
            }
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.pgxflow[0].module.lambda-sendJobEmail.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/lambda/sendJobEmail",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/dbe5a7fe1c70271457859c78a97d99f5fb3bb59ac1969fde460690ec91500c2a.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/dbe5a7fe1c70271457859c78a97d99f5fb3bb59ac1969fde460690ec91500c2a.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.lambda-sendJobEmail.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/dbe5a7fe1c70271457859c78a97d99f5fb3bb59ac1969fde460690ec91500c2a.zip"
          + "timestamp" = "1753771439297476000"
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.data.aws_iam_policy_document.lambda-dbsnp will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-dbsnp" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal-20250619023046541400000001",
            ]

          + condition {
              + test     = "StringLike"
              + values   = [
                  + "projects/*/project-files/*",
                ]
              + variable = "s3:prefix"
            }
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::pgxflow-backend-references-20250619023037268600000002",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal-20250619023046541400000001/projects/*/project-files/*",
              + "arn:aws:s3:::pgxflow-backend-references-20250619023037268600000002/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::pgxflow-backend-20250619023038383000000003/*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-clinic-jobs",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-lookup",
              + (known after apply),
            ]
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.data.aws_iam_policy_document.lambda-gnomad will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-gnomad" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::pgxflow-backend-20250619023038383000000003/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal-20250619023046541400000001/projects/*/clinical-workflows/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
            ]
          + resources = [
              + "arn:aws:s3:::pgxflow-backend-20250619023038383000000003/*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-clinic-jobs",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.data.aws_iam_policy_document.lambda-lookup will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-lookup" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::pgxflow-backend-20250619023038383000000003",
              + "arn:aws:s3:::pgxflow-backend-references-20250619023037268600000002",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::pgxflow-backend-20250619023038383000000003/*",
              + "arn:aws:s3:::pgxflow-backend-references-20250619023037268600000002/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::pgxflow-backend-20250619023038383000000003/*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-clinic-jobs",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-gnomad",
              + (known after apply),
            ]
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_integration.results-get will be destroyed
  # (because aws_api_gateway_integration.results-get is not in configuration)
  - resource "aws_api_gateway_integration" "results-get" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "xbn14b" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "GET" -> null
      - id                      = "agi-cy0g8gkrzd-xbn14b-GET" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - region                  = "ap-southeast-3" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "xbn14b" -> null
      - rest_api_id             = "cy0g8gkrzd" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-lookup-getResultsURL/invocations" -> null
        # (3 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_integration.results-options will be destroyed
  # (because aws_api_gateway_integration.results-options is not in configuration)
  - resource "aws_api_gateway_integration" "results-options" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "xbn14b" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "OPTIONS" -> null
      - id                      = "agi-cy0g8gkrzd-xbn14b-OPTIONS" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - region                  = "ap-southeast-3" -> null
      - request_parameters      = {} -> null
      - request_templates       = {
          - "application/json" = <<-EOT
                {
                        "statusCode": 200
                      }
            EOT
        } -> null
      - resource_id             = "xbn14b" -> null
      - rest_api_id             = "cy0g8gkrzd" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "MOCK" -> null
        # (5 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_integration.submit-options will be destroyed
  # (because aws_api_gateway_integration.submit-options is not in configuration)
  - resource "aws_api_gateway_integration" "submit-options" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "mbuauq" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "OPTIONS" -> null
      - id                      = "agi-cy0g8gkrzd-mbuauq-OPTIONS" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - region                  = "ap-southeast-3" -> null
      - request_parameters      = {} -> null
      - request_templates       = {
          - "application/json" = <<-EOT
                {
                        "statusCode": 200
                      }
            EOT
        } -> null
      - resource_id             = "mbuauq" -> null
      - rest_api_id             = "cy0g8gkrzd" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "MOCK" -> null
        # (5 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_integration.submit-patch will be destroyed
  # (because aws_api_gateway_integration.submit-patch is not in configuration)
  - resource "aws_api_gateway_integration" "submit-patch" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "mbuauq" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "PATCH" -> null
      - id                      = "agi-cy0g8gkrzd-mbuauq-PATCH" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - region                  = "ap-southeast-3" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "mbuauq" -> null
      - rest_api_id             = "cy0g8gkrzd" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-initLookup/invocations" -> null
        # (3 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_integration.submit-post will be destroyed
  # (because aws_api_gateway_integration.submit-post is not in configuration)
  - resource "aws_api_gateway_integration" "submit-post" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "mbuauq" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "POST" -> null
      - id                      = "agi-cy0g8gkrzd-mbuauq-POST" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - region                  = "ap-southeast-3" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "mbuauq" -> null
      - rest_api_id             = "cy0g8gkrzd" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-initLookup/invocations" -> null
        # (3 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_integration_response.results-get will be destroyed
  # (because aws_api_gateway_integration_response.results-get is not in configuration)
  - resource "aws_api_gateway_integration_response" "results-get" {
      - http_method         = "GET" -> null
      - id                  = "agir-cy0g8gkrzd-xbn14b-GET-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "xbn14b" -> null
      - response_parameters = {} -> null
      - response_templates  = {
          - "application/json" = null
        } -> null
      - rest_api_id         = "cy0g8gkrzd" -> null
      - status_code         = "200" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_integration_response.results-options will be destroyed
  # (because aws_api_gateway_integration_response.results-options is not in configuration)
  - resource "aws_api_gateway_integration_response" "results-options" {
      - http_method         = "OPTIONS" -> null
      - id                  = "agir-cy0g8gkrzd-xbn14b-OPTIONS-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "xbn14b" -> null
      - response_parameters = {
          - "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          - "method.response.header.Access-Control-Allow-Methods" = "'OPTIONS,GET'"
          - "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        } -> null
      - response_templates  = {
          - "application/json" = null
        } -> null
      - rest_api_id         = "cy0g8gkrzd" -> null
      - status_code         = "200" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_integration_response.submit-options will be destroyed
  # (because aws_api_gateway_integration_response.submit-options is not in configuration)
  - resource "aws_api_gateway_integration_response" "submit-options" {
      - http_method         = "OPTIONS" -> null
      - id                  = "agir-cy0g8gkrzd-mbuauq-OPTIONS-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "mbuauq" -> null
      - response_parameters = {
          - "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          - "method.response.header.Access-Control-Allow-Methods" = "'OPTIONS,PATCH,POST'"
          - "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        } -> null
      - response_templates  = {
          - "application/json" = null
        } -> null
      - rest_api_id         = "cy0g8gkrzd" -> null
      - status_code         = "200" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_integration_response.submit-patch will be destroyed
  # (because aws_api_gateway_integration_response.submit-patch is not in configuration)
  - resource "aws_api_gateway_integration_response" "submit-patch" {
      - http_method         = "PATCH" -> null
      - id                  = "agir-cy0g8gkrzd-mbuauq-PATCH-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "mbuauq" -> null
      - response_parameters = {} -> null
      - response_templates  = {
          - "application/json" = null
        } -> null
      - rest_api_id         = "cy0g8gkrzd" -> null
      - status_code         = "200" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_integration_response.submit-post will be destroyed
  # (because aws_api_gateway_integration_response.submit-post is not in configuration)
  - resource "aws_api_gateway_integration_response" "submit-post" {
      - http_method         = "POST" -> null
      - id                  = "agir-cy0g8gkrzd-mbuauq-POST-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "mbuauq" -> null
      - response_parameters = {} -> null
      - response_templates  = {
          - "application/json" = null
        } -> null
      - rest_api_id         = "cy0g8gkrzd" -> null
      - status_code         = "200" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_method.results-get will be destroyed
  # (because aws_api_gateway_method.results-get is not in configuration)
  - resource "aws_api_gateway_method" "results-get" {
      - api_key_required     = false -> null
      - authorization        = "COGNITO_USER_POOLS" -> null
      - authorization_scopes = [] -> null
      - authorizer_id        = "1h2hn3" -> null
      - http_method          = "GET" -> null
      - id                   = "agm-cy0g8gkrzd-xbn14b-GET" -> null
      - region               = "ap-southeast-3" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "xbn14b" -> null
      - rest_api_id          = "cy0g8gkrzd" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_method.results-options will be destroyed
  # (because aws_api_gateway_method.results-options is not in configuration)
  - resource "aws_api_gateway_method" "results-options" {
      - api_key_required     = false -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "OPTIONS" -> null
      - id                   = "agm-cy0g8gkrzd-xbn14b-OPTIONS" -> null
      - region               = "ap-southeast-3" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "xbn14b" -> null
      - rest_api_id          = "cy0g8gkrzd" -> null
        # (3 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_method.submit-options will be destroyed
  # (because aws_api_gateway_method.submit-options is not in configuration)
  - resource "aws_api_gateway_method" "submit-options" {
      - api_key_required     = false -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "OPTIONS" -> null
      - id                   = "agm-cy0g8gkrzd-mbuauq-OPTIONS" -> null
      - region               = "ap-southeast-3" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "mbuauq" -> null
      - rest_api_id          = "cy0g8gkrzd" -> null
        # (3 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_method.submit-patch will be destroyed
  # (because aws_api_gateway_method.submit-patch is not in configuration)
  - resource "aws_api_gateway_method" "submit-patch" {
      - api_key_required     = false -> null
      - authorization        = "COGNITO_USER_POOLS" -> null
      - authorization_scopes = [] -> null
      - authorizer_id        = "1h2hn3" -> null
      - http_method          = "PATCH" -> null
      - id                   = "agm-cy0g8gkrzd-mbuauq-PATCH" -> null
      - region               = "ap-southeast-3" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "mbuauq" -> null
      - rest_api_id          = "cy0g8gkrzd" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_method.submit-post will be destroyed
  # (because aws_api_gateway_method.submit-post is not in configuration)
  - resource "aws_api_gateway_method" "submit-post" {
      - api_key_required     = false -> null
      - authorization        = "COGNITO_USER_POOLS" -> null
      - authorization_scopes = [] -> null
      - authorizer_id        = "1h2hn3" -> null
      - http_method          = "POST" -> null
      - id                   = "agm-cy0g8gkrzd-mbuauq-POST" -> null
      - region               = "ap-southeast-3" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "mbuauq" -> null
      - rest_api_id          = "cy0g8gkrzd" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_method_response.results-get will be destroyed
  # (because aws_api_gateway_method_response.results-get is not in configuration)
  - resource "aws_api_gateway_method_response" "results-get" {
      - http_method         = "GET" -> null
      - id                  = "agmr-cy0g8gkrzd-xbn14b-GET-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "xbn14b" -> null
      - response_models     = {
          - "application/json" = "Empty"
        } -> null
      - response_parameters = {
          - "method.response.header.Access-Control-Allow-Origin" = true
        } -> null
      - rest_api_id         = "cy0g8gkrzd" -> null
      - status_code         = "200" -> null
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_method_response.results-options will be destroyed
  # (because aws_api_gateway_method_response.results-options is not in configuration)
  - resource "aws_api_gateway_method_response" "results-options" {
      - http_method         = "OPTIONS" -> null
      - id                  = "agmr-cy0g8gkrzd-xbn14b-OPTIONS-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "xbn14b" -> null
      - response_models     = {
          - "application/json" = "Empty"
        } -> null
      - response_parameters = {
          - "method.response.header.Access-Control-Allow-Headers" = true
          - "method.response.header.Access-Control-Allow-Methods" = true
          - "method.response.header.Access-Control-Allow-Origin"  = true
        } -> null
      - rest_api_id         = "cy0g8gkrzd" -> null
      - status_code         = "200" -> null
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_method_response.submit-options will be destroyed
  # (because aws_api_gateway_method_response.submit-options is not in configuration)
  - resource "aws_api_gateway_method_response" "submit-options" {
      - http_method         = "OPTIONS" -> null
      - id                  = "agmr-cy0g8gkrzd-mbuauq-OPTIONS-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "mbuauq" -> null
      - response_models     = {
          - "application/json" = "Empty"
        } -> null
      - response_parameters = {
          - "method.response.header.Access-Control-Allow-Headers" = true
          - "method.response.header.Access-Control-Allow-Methods" = true
          - "method.response.header.Access-Control-Allow-Origin"  = true
        } -> null
      - rest_api_id         = "cy0g8gkrzd" -> null
      - status_code         = "200" -> null
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_method_response.submit-patch will be destroyed
  # (because aws_api_gateway_method_response.submit-patch is not in configuration)
  - resource "aws_api_gateway_method_response" "submit-patch" {
      - http_method         = "PATCH" -> null
      - id                  = "agmr-cy0g8gkrzd-mbuauq-PATCH-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "mbuauq" -> null
      - response_models     = {
          - "application/json" = "Empty"
        } -> null
      - response_parameters = {
          - "method.response.header.Access-Control-Allow-Origin" = true
        } -> null
      - rest_api_id         = "cy0g8gkrzd" -> null
      - status_code         = "200" -> null
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_method_response.submit-post will be destroyed
  # (because aws_api_gateway_method_response.submit-post is not in configuration)
  - resource "aws_api_gateway_method_response" "submit-post" {
      - http_method         = "POST" -> null
      - id                  = "agmr-cy0g8gkrzd-mbuauq-POST-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "mbuauq" -> null
      - response_models     = {
          - "application/json" = "Empty"
        } -> null
      - response_parameters = {
          - "method.response.header.Access-Control-Allow-Origin" = true
        } -> null
      - rest_api_id         = "cy0g8gkrzd" -> null
      - status_code         = "200" -> null
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_resource.pipeline_lookup will be destroyed
  # (because aws_api_gateway_resource.pipeline_lookup is not in configuration)
  - resource "aws_api_gateway_resource" "pipeline_lookup" {
      - id          = "44o6sc" -> null
      - parent_id   = "t5gnvipavc" -> null
      - path        = "/pipeline_lookup" -> null
      - path_part   = "pipeline_lookup" -> null
      - region      = "ap-southeast-3" -> null
      - rest_api_id = "cy0g8gkrzd" -> null
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_resource.results will be destroyed
  # (because aws_api_gateway_resource.results is not in configuration)
  - resource "aws_api_gateway_resource" "results" {
      - id          = "xbn14b" -> null
      - parent_id   = "44o6sc" -> null
      - path        = "/pipeline_lookup/results" -> null
      - path_part   = "results" -> null
      - region      = "ap-southeast-3" -> null
      - rest_api_id = "cy0g8gkrzd" -> null
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_resource.submit will be destroyed
  # (because aws_api_gateway_resource.submit is not in configuration)
  - resource "aws_api_gateway_resource" "submit" {
      - id          = "mbuauq" -> null
      - parent_id   = "44o6sc" -> null
      - path        = "/pipeline_lookup/submit" -> null
      - path_part   = "submit" -> null
      - region      = "ap-southeast-3" -> null
      - rest_api_id = "cy0g8gkrzd" -> null
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_lambda_permission.APIGetResultsURL will be destroyed
  # (because aws_lambda_permission.APIGetResultsURL is not in configuration)
  - resource "aws_lambda_permission" "APIGetResultsURL" {
      - action              = "lambda:InvokeFunction" -> null
      - function_name       = "pgxflow-backend-lookup-getResultsURL" -> null
      - id                  = "AllowAPIGetResultsURLInvoke" -> null
      - principal           = "apigateway.amazonaws.com" -> null
      - region              = "ap-southeast-3" -> null
      - source_arn          = "arn:aws:execute-api:ap-southeast-3:438465168484:cy0g8gkrzd/*/*/results" -> null
      - statement_id        = "AllowAPIGetResultsURLInvoke" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_lambda_permission.APIInitLookup will be destroyed
  # (because aws_lambda_permission.APIInitLookup is not in configuration)
  - resource "aws_lambda_permission" "APIInitLookup" {
      - action              = "lambda:InvokeFunction" -> null
      - function_name       = "pgxflow-backend-initLookup" -> null
      - id                  = "AllowAPIInitLookupInvoke" -> null
      - principal           = "apigateway.amazonaws.com" -> null
      - region              = "ap-southeast-3" -> null
      - source_arn          = "arn:aws:execute-api:ap-southeast-3:438465168484:cy0g8gkrzd/*/*/submit" -> null
      - statement_id        = "AllowAPIInitLookupInvoke" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_lambda_permission.LambdaDbsnp will be destroyed
  # (because aws_lambda_permission.LambdaDbsnp is not in configuration)
  - resource "aws_lambda_permission" "LambdaDbsnp" {
      - action              = "lambda:InvokeFunction" -> null
      - function_name       = "arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-dbsnp" -> null
      - id                  = "PGxFlowBackendAllowDbsnpInvoke" -> null
      - principal           = "lambda.amazonaws.com" -> null
      - region              = "ap-southeast-3" -> null
      - source_arn          = "arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-initLookup" -> null
      - statement_id        = "PGxFlowBackendAllowDbsnpInvoke" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_lambda_permission.cloudwatch_lookup_reference_update_permission will be created
  + resource "aws_lambda_permission" "cloudwatch_lookup_reference_update_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "pgxflow-backend-lookup-updateReferenceFiles"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = "arn:aws:events:ap-southeast-3:438465168484:rule/lookup_update_references_trigger"
      + statement_id        = "CloudwatchLookupReferenceUpdateAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_lambda_permission.dbsnp_invoke_permission will be created
  + resource "aws_lambda_permission" "dbsnp_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "pgxflow-backend-dbsnp"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "SNSDbsnpAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_sns_topic.dbsnp will be created
  + resource "aws_sns_topic" "dbsnp" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "pgxflow-backend-dbsnp"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-3"
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_sns_topic_subscription.dbsnp will be created
  + resource "aws_sns_topic_subscription" "dbsnp" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-dbsnp"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + region                          = "ap-southeast-3"
      + topic_arn                       = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.data.aws_iam_policy_document.lambda-gnomad will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-gnomad" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::pgxflow-backend-20250619023038383000000003/*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-clinic-jobs",
            ]
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal-20250619023046541400000001/projects/*/clinical-workflows/*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.data.aws_iam_policy_document.lambda-pharmcat will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-pharmcat" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::pgxflow-backend-20250619023038383000000003",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::pgxflow-backend-20250619023038383000000003/*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-clinic-jobs",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-postprocessor",
              + (known after apply),
            ]
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.data.aws_iam_policy_document.lambda-postprocessor will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-postprocessor" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal-20250619023046541400000001",
              + "arn:aws:s3:::pgxflow-backend-20250619023038383000000003",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::pgxflow-backend-20250619023038383000000003/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal-20250619023046541400000001/projects/*/project-files/*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-pharmcat-gnomad",
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-clinic-jobs",
            ]
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.data.aws_iam_policy_document.lambda-preprocessor will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-preprocessor" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal-20250619023046541400000001",
              + "arn:aws:s3:::pgxflow-backend-references-20250619023037268600000002",
            ]

          + condition {
              + test     = "StringLike"
              + values   = [
                  + "projects/*/project-files/*",
                ]
              + variable = "s3:prefix"
            }
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal-20250619023046541400000001/projects/*/project-files/*",
              + "arn:aws:s3:::pgxflow-backend-references-20250619023037268600000002/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::pgxflow-backend-20250619023038383000000003/*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-clinic-jobs",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-pharmcat",
              + (known after apply),
            ]
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_integration.results-get will be destroyed
  # (because aws_api_gateway_integration.results-get is not in configuration)
  - resource "aws_api_gateway_integration" "results-get" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "8lebk5" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "GET" -> null
      - id                      = "agi-cy0g8gkrzd-8lebk5-GET" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - region                  = "ap-southeast-3" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "8lebk5" -> null
      - rest_api_id             = "cy0g8gkrzd" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-pharmcat-getResultsURL/invocations" -> null
        # (3 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_integration.results-options will be destroyed
  # (because aws_api_gateway_integration.results-options is not in configuration)
  - resource "aws_api_gateway_integration" "results-options" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "8lebk5" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "OPTIONS" -> null
      - id                      = "agi-cy0g8gkrzd-8lebk5-OPTIONS" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - region                  = "ap-southeast-3" -> null
      - request_parameters      = {} -> null
      - request_templates       = {
          - "application/json" = <<-EOT
                {
                        "statusCode": 200
                      }
            EOT
        } -> null
      - resource_id             = "8lebk5" -> null
      - rest_api_id             = "cy0g8gkrzd" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "MOCK" -> null
        # (5 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_integration.submit-options will be destroyed
  # (because aws_api_gateway_integration.submit-options is not in configuration)
  - resource "aws_api_gateway_integration" "submit-options" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "g14z9q" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "OPTIONS" -> null
      - id                      = "agi-cy0g8gkrzd-g14z9q-OPTIONS" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - region                  = "ap-southeast-3" -> null
      - request_parameters      = {} -> null
      - request_templates       = {
          - "application/json" = <<-EOT
                {
                        "statusCode": 200
                      }
            EOT
        } -> null
      - resource_id             = "g14z9q" -> null
      - rest_api_id             = "cy0g8gkrzd" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "MOCK" -> null
        # (5 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_integration.submit-patch will be destroyed
  # (because aws_api_gateway_integration.submit-patch is not in configuration)
  - resource "aws_api_gateway_integration" "submit-patch" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "g14z9q" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "PATCH" -> null
      - id                      = "agi-cy0g8gkrzd-g14z9q-PATCH" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - region                  = "ap-southeast-3" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "g14z9q" -> null
      - rest_api_id             = "cy0g8gkrzd" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-initPharmcat/invocations" -> null
        # (3 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_integration.submit-post will be destroyed
  # (because aws_api_gateway_integration.submit-post is not in configuration)
  - resource "aws_api_gateway_integration" "submit-post" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "g14z9q" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "POST" -> null
      - id                      = "agi-cy0g8gkrzd-g14z9q-POST" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - region                  = "ap-southeast-3" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "g14z9q" -> null
      - rest_api_id             = "cy0g8gkrzd" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-initPharmcat/invocations" -> null
        # (3 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_integration_response.results-get will be destroyed
  # (because aws_api_gateway_integration_response.results-get is not in configuration)
  - resource "aws_api_gateway_integration_response" "results-get" {
      - http_method         = "GET" -> null
      - id                  = "agir-cy0g8gkrzd-8lebk5-GET-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "8lebk5" -> null
      - response_parameters = {} -> null
      - response_templates  = {
          - "application/json" = null
        } -> null
      - rest_api_id         = "cy0g8gkrzd" -> null
      - status_code         = "200" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_integration_response.results-options will be destroyed
  # (because aws_api_gateway_integration_response.results-options is not in configuration)
  - resource "aws_api_gateway_integration_response" "results-options" {
      - http_method         = "OPTIONS" -> null
      - id                  = "agir-cy0g8gkrzd-8lebk5-OPTIONS-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "8lebk5" -> null
      - response_parameters = {
          - "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          - "method.response.header.Access-Control-Allow-Methods" = "'OPTIONS,GET'"
          - "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        } -> null
      - response_templates  = {
          - "application/json" = null
        } -> null
      - rest_api_id         = "cy0g8gkrzd" -> null
      - status_code         = "200" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_integration_response.submit-options will be destroyed
  # (because aws_api_gateway_integration_response.submit-options is not in configuration)
  - resource "aws_api_gateway_integration_response" "submit-options" {
      - http_method         = "OPTIONS" -> null
      - id                  = "agir-cy0g8gkrzd-g14z9q-OPTIONS-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "g14z9q" -> null
      - response_parameters = {
          - "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          - "method.response.header.Access-Control-Allow-Methods" = "'OPTIONS,PATCH,POST'"
          - "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        } -> null
      - response_templates  = {
          - "application/json" = null
        } -> null
      - rest_api_id         = "cy0g8gkrzd" -> null
      - status_code         = "200" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_integration_response.submit-patch will be destroyed
  # (because aws_api_gateway_integration_response.submit-patch is not in configuration)
  - resource "aws_api_gateway_integration_response" "submit-patch" {
      - http_method         = "PATCH" -> null
      - id                  = "agir-cy0g8gkrzd-g14z9q-PATCH-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "g14z9q" -> null
      - response_parameters = {} -> null
      - response_templates  = {
          - "application/json" = null
        } -> null
      - rest_api_id         = "cy0g8gkrzd" -> null
      - status_code         = "200" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_integration_response.submit-post will be destroyed
  # (because aws_api_gateway_integration_response.submit-post is not in configuration)
  - resource "aws_api_gateway_integration_response" "submit-post" {
      - http_method         = "POST" -> null
      - id                  = "agir-cy0g8gkrzd-g14z9q-POST-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "g14z9q" -> null
      - response_parameters = {} -> null
      - response_templates  = {
          - "application/json" = null
        } -> null
      - rest_api_id         = "cy0g8gkrzd" -> null
      - status_code         = "200" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_method.results-get will be destroyed
  # (because aws_api_gateway_method.results-get is not in configuration)
  - resource "aws_api_gateway_method" "results-get" {
      - api_key_required     = false -> null
      - authorization        = "COGNITO_USER_POOLS" -> null
      - authorization_scopes = [] -> null
      - authorizer_id        = "1h2hn3" -> null
      - http_method          = "GET" -> null
      - id                   = "agm-cy0g8gkrzd-8lebk5-GET" -> null
      - region               = "ap-southeast-3" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "8lebk5" -> null
      - rest_api_id          = "cy0g8gkrzd" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_method.results-options will be destroyed
  # (because aws_api_gateway_method.results-options is not in configuration)
  - resource "aws_api_gateway_method" "results-options" {
      - api_key_required     = false -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "OPTIONS" -> null
      - id                   = "agm-cy0g8gkrzd-8lebk5-OPTIONS" -> null
      - region               = "ap-southeast-3" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "8lebk5" -> null
      - rest_api_id          = "cy0g8gkrzd" -> null
        # (3 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_method.submit-options will be destroyed
  # (because aws_api_gateway_method.submit-options is not in configuration)
  - resource "aws_api_gateway_method" "submit-options" {
      - api_key_required     = false -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "OPTIONS" -> null
      - id                   = "agm-cy0g8gkrzd-g14z9q-OPTIONS" -> null
      - region               = "ap-southeast-3" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "g14z9q" -> null
      - rest_api_id          = "cy0g8gkrzd" -> null
        # (3 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_method.submit-patch will be destroyed
  # (because aws_api_gateway_method.submit-patch is not in configuration)
  - resource "aws_api_gateway_method" "submit-patch" {
      - api_key_required     = false -> null
      - authorization        = "COGNITO_USER_POOLS" -> null
      - authorization_scopes = [] -> null
      - authorizer_id        = "1h2hn3" -> null
      - http_method          = "PATCH" -> null
      - id                   = "agm-cy0g8gkrzd-g14z9q-PATCH" -> null
      - region               = "ap-southeast-3" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "g14z9q" -> null
      - rest_api_id          = "cy0g8gkrzd" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_method.submit-post will be destroyed
  # (because aws_api_gateway_method.submit-post is not in configuration)
  - resource "aws_api_gateway_method" "submit-post" {
      - api_key_required     = false -> null
      - authorization        = "COGNITO_USER_POOLS" -> null
      - authorization_scopes = [] -> null
      - authorizer_id        = "1h2hn3" -> null
      - http_method          = "POST" -> null
      - id                   = "agm-cy0g8gkrzd-g14z9q-POST" -> null
      - region               = "ap-southeast-3" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "g14z9q" -> null
      - rest_api_id          = "cy0g8gkrzd" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_method_response.results-get will be destroyed
  # (because aws_api_gateway_method_response.results-get is not in configuration)
  - resource "aws_api_gateway_method_response" "results-get" {
      - http_method         = "GET" -> null
      - id                  = "agmr-cy0g8gkrzd-8lebk5-GET-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "8lebk5" -> null
      - response_models     = {
          - "application/json" = "Empty"
        } -> null
      - response_parameters = {
          - "method.response.header.Access-Control-Allow-Origin" = true
        } -> null
      - rest_api_id         = "cy0g8gkrzd" -> null
      - status_code         = "200" -> null
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_method_response.results-options will be destroyed
  # (because aws_api_gateway_method_response.results-options is not in configuration)
  - resource "aws_api_gateway_method_response" "results-options" {
      - http_method         = "OPTIONS" -> null
      - id                  = "agmr-cy0g8gkrzd-8lebk5-OPTIONS-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "8lebk5" -> null
      - response_models     = {
          - "application/json" = "Empty"
        } -> null
      - response_parameters = {
          - "method.response.header.Access-Control-Allow-Headers" = true
          - "method.response.header.Access-Control-Allow-Methods" = true
          - "method.response.header.Access-Control-Allow-Origin"  = true
        } -> null
      - rest_api_id         = "cy0g8gkrzd" -> null
      - status_code         = "200" -> null
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_method_response.submit-options will be destroyed
  # (because aws_api_gateway_method_response.submit-options is not in configuration)
  - resource "aws_api_gateway_method_response" "submit-options" {
      - http_method         = "OPTIONS" -> null
      - id                  = "agmr-cy0g8gkrzd-g14z9q-OPTIONS-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "g14z9q" -> null
      - response_models     = {
          - "application/json" = "Empty"
        } -> null
      - response_parameters = {
          - "method.response.header.Access-Control-Allow-Headers" = true
          - "method.response.header.Access-Control-Allow-Methods" = true
          - "method.response.header.Access-Control-Allow-Origin"  = true
        } -> null
      - rest_api_id         = "cy0g8gkrzd" -> null
      - status_code         = "200" -> null
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_method_response.submit-patch will be destroyed
  # (because aws_api_gateway_method_response.submit-patch is not in configuration)
  - resource "aws_api_gateway_method_response" "submit-patch" {
      - http_method         = "PATCH" -> null
      - id                  = "agmr-cy0g8gkrzd-g14z9q-PATCH-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "g14z9q" -> null
      - response_models     = {
          - "application/json" = "Empty"
        } -> null
      - response_parameters = {
          - "method.response.header.Access-Control-Allow-Origin" = true
        } -> null
      - rest_api_id         = "cy0g8gkrzd" -> null
      - status_code         = "200" -> null
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_method_response.submit-post will be destroyed
  # (because aws_api_gateway_method_response.submit-post is not in configuration)
  - resource "aws_api_gateway_method_response" "submit-post" {
      - http_method         = "POST" -> null
      - id                  = "agmr-cy0g8gkrzd-g14z9q-POST-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "g14z9q" -> null
      - response_models     = {
          - "application/json" = "Empty"
        } -> null
      - response_parameters = {
          - "method.response.header.Access-Control-Allow-Origin" = true
        } -> null
      - rest_api_id         = "cy0g8gkrzd" -> null
      - status_code         = "200" -> null
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_resource.pipeline_pharmcat will be destroyed
  # (because aws_api_gateway_resource.pipeline_pharmcat is not in configuration)
  - resource "aws_api_gateway_resource" "pipeline_pharmcat" {
      - id          = "buzi4a" -> null
      - parent_id   = "t5gnvipavc" -> null
      - path        = "/pipeline_pharmcat" -> null
      - path_part   = "pipeline_pharmcat" -> null
      - region      = "ap-southeast-3" -> null
      - rest_api_id = "cy0g8gkrzd" -> null
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_resource.results will be destroyed
  # (because aws_api_gateway_resource.results is not in configuration)
  - resource "aws_api_gateway_resource" "results" {
      - id          = "8lebk5" -> null
      - parent_id   = "buzi4a" -> null
      - path        = "/pipeline_pharmcat/results" -> null
      - path_part   = "results" -> null
      - region      = "ap-southeast-3" -> null
      - rest_api_id = "cy0g8gkrzd" -> null
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_resource.submit will be destroyed
  # (because aws_api_gateway_resource.submit is not in configuration)
  - resource "aws_api_gateway_resource" "submit" {
      - id          = "g14z9q" -> null
      - parent_id   = "buzi4a" -> null
      - path        = "/pipeline_pharmcat/submit" -> null
      - path_part   = "submit" -> null
      - region      = "ap-southeast-3" -> null
      - rest_api_id = "cy0g8gkrzd" -> null
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_lambda_permission.APIGetResultsURL will be destroyed
  # (because aws_lambda_permission.APIGetResultsURL is not in configuration)
  - resource "aws_lambda_permission" "APIGetResultsURL" {
      - action              = "lambda:InvokeFunction" -> null
      - function_name       = "pgxflow-backend-pharmcat-getResultsURL" -> null
      - id                  = "AllowAPIGetResultsURLInvoke" -> null
      - principal           = "apigateway.amazonaws.com" -> null
      - region              = "ap-southeast-3" -> null
      - source_arn          = "arn:aws:execute-api:ap-southeast-3:438465168484:cy0g8gkrzd/*/*/results" -> null
      - statement_id        = "AllowAPIGetResultsURLInvoke" -> null
        # (2 unchanged attributes hidden)
    }


```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.